# Третий семестр: Промышленное программирование, Операционные системы и Алгоритмы и структура данных.
## Лабораторные работы выполненные за первое полугодие второго курса обучения в БГУ:
### ПП(Промышленное программирование):
- [Лабораторная работа 1](#лабораторная-работа-1)

### Примечание: Во всех лабораторных по ПП выполнен шестой вариант индивидульного задания!

### ОС(Операционные системы):

### АиСД(Алгоритмы и структура данных):
- [Задача 0.0](#задача-00)
- [Задача 0.1: Бинарный поиск.](#задача-01-бинарный-поиск)

# ПП(Промышленное программирование)

## Лабораторная работа 1

### Общее задание:
1. Разработать консольное приложение на Java.
2. Вычисление ряда выполнить в отдельном классе (не загрузочном)!
3. Функция представлена в виде своего ряда Тейлора. Вычислить приближенное значение суммы этого бесконечного ряда. Вычисления заканчивать, когда очередное слагаемое окажется по модулю меньше заданного числа ∑. Вид этого числа определяется  следующим условием:
 ∑ = 10-k, где k – натуральное число. 
4. Значения x и k ввести с клавиатуры. 
5. Факториал и степень в слагаемых отдельно не считать!
6. Сравнить полученный результат со значением, вычисленным через стандартные функции.
7. Класс Scaner использовать для варианта с простыми типами 
8. Класс BufferedReader для чтения данных использовать для варианта с большими типами Big...
9. Используя  класс Formatter реализовать :
- Выводить некоторые целые значения (округлить) в восьмеричном и шестнадцатеричном виде
- Для чисел с плавающей точкой использовать спецификатор минимальной ширины поля и 
спецификатор точности (количество знаков после запятой =к+1)
- Использовать флаги (flags) форматирования: 0,+)#
10. Использовать  для вывода спецификатор минимальной ширины поля и спецификатор точности в методе System.out.println().

### Индивидуальное задание:

# ОС(Операционные системы)

# АиСД(Алгоритмы и структура данных)

## Задача 0.0

### Ограничения:
- Имя входного файла: input.txt
- Имя выходного файла: output.txt
- Ограничение по времени: 1 с
- Ограничение по памяти: нет

### Условие:
Дано бинарное поисковое дерево, в котором ключи вершин являются целыми числами в диапазоне от $-2^{31}$ до $2^{31} - 1$ включительно. Найдите сумму ключей всех вершин дерева.

### Формат входных данных:
Входной файл содержит последовательность чисел — ключи вершин в порядке добавления в дерево. Ключи задаются в формате по одному в строке.
В поисковом дереве все ключи по определению уникальны, поэтому при попытке добавить в дерево ключ, который там уже есть, он игнорируется.

### Формат выходных данных:
Выведите единственное число — сумму ключей в построенном дереве.

## Задача 0.1: Бинарный поиск.

### Ограничения:
- Имя входного файла: стандартный ввод
- Имя выходного файла: стандартный вывод
- Ограничение по времени: 3 с
- Ограничение по памяти: 256 МБ

### Условие:
Реализуйте бинарный поиск на массиве чисел, отсортированном в неубывающем порядке.Запрещается использование готовых функций бинарного поиска из стандартных библиотек.

### Формат входных данных:
В первой строке записано целое число $n$ — количество чисел в массиве ($0 \leqslant n \leqslant 3 \cdot 10^5$).Во второй строке через пробел записаны $n$ чисел массива. Все числа целые и принадлежат промежутку от $-2^{31}$ до $2^{31} - 1$ включительно. Числа в массиве упорядочены по неубыванию.В третьей строке записано целое число $k$ — количество запросов ($0 \leqslant k \leqslant 3 \cdot 10^5$).В четвёртой строке через пробел записаны $k$ целых чисел-запросов из промежутка от $-2^{31}$ до $2^{31} - 1$ включительно.

### Формат выходных данных:
Для каждого числа-запроса $x$ в отдельной строке выведите через пробел числа $b$, $l$ и $r$, где $b$ равно $1$, если $x$ присутствует в массиве, или $0$ в противном случае; $l$ — индекс первого элемента, большего либо равного $x$; $r$ — индекс первого элемента, большего $x$. Элементы массива нумеруются индексами от $0$ до $n-1$. Если подходящих элементов в массиве нет, договоримся, что возвращаемый индекс будет равен $n$.
